andrewleech/micropython/ports/stm32/mpzephyrport.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2025 MicroPython Contributors
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

// STM32 port integration for Zephyr BLE stack
// Works with both UART HCI transport and STM32WB IPCC transport

#include "py/mpconfig.h"

// Enable hard fault debug output for diagnostics
#include "stm32_it.h"

#if MICROPY_PY_BLUETOOTH && MICROPY_BLUETOOTH_ZEPHYR

#include "py/runtime.h"
#include "py/mphal.h"
#include "extmod/modbluetooth.h"
#include "extmod/mpbthci.h"
#include "shared/runtime/softtimer.h"

// Don't include mpbthciport.h - it defines mp_bluetooth_hci_poll_now as static inline
// which conflicts with our non-inline definition needed by modbluetooth_zephyr.c.
// Instead, declare the specific functions we need from mpbthciport.c:
extern void mp_bluetooth_hci_poll_now_default(void);

#include <string.h>

#include "uart.h"
#include "rfcore.h"
#include "extmod/zephyr_ble/hal/zephyr_ble_hal.h"
#include "zephyr/device.h"
#include <zephyr/net_buf.h>
#include <zephyr/drivers/bluetooth.h>

// Suppress deprecation warning for bt_buf_get_type()
// The function is deprecated in Zephyr but still works and is the standard API
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wdeprecated-declarations"
#include <zephyr/bluetooth/buf.h>
#pragma GCC diagnostic pop

// Debug macros - conditional based on ZEPHYR_BLE_DEBUG
#if ZEPHYR_BLE_DEBUG
#define DEBUG_HCI_printf(...) mp_printf(&mp_plat_print, "HCI: " __VA_ARGS__)
#else
#define DEBUG_HCI_printf(...) do {} while (0)
#endif

// Error messages are always printed
#define error_printf(...) mp_printf(&mp_plat_print, "HCI ERROR: " __VA_ARGS__)

// H:4 packet types
#define H4_CMD  0x01
#define H4_ACL  0x02
#define H4_SCO  0x03
#define H4_EVT  0x04

// Zephyr HCI driver callback and device
static const struct device *hci_dev = NULL;
static bt_hci_recv_t recv_cb = NULL;

// Soft timer for scheduling HCI poll (zero-initialized to prevent startup crashes)
static soft_timer_entry_t mp_zephyr_hci_soft_timer = {0};
static mp_sched_node_t mp_zephyr_hci_sched_node = {0};

// Queue for completed HCI packets (received from interrupt context)
// These are deferred for processing in scheduler context to avoid stack overflow
// Increased from 8 to 32 to handle burst of advertising reports during scanning
#define RX_QUEUE_SIZE 32
static struct net_buf *rx_queue[RX_QUEUE_SIZE];
static volatile size_t rx_queue_head = 0;
static volatile size_t rx_queue_tail = 0;


// H:4 packet parser state
typedef enum {
    H4_STATE_TYPE,      // Waiting for packet type byte
    H4_STATE_HEADER,    // Reading packet header
    H4_STATE_PAYLOAD,   // Reading packet payload
} h4_state_t;

static h4_state_t h4_state = H4_STATE_TYPE;
static uint8_t h4_type;
static uint8_t h4_header_buf[4];  // Max header size (ACL: 4 bytes)
static size_t h4_header_idx;
static size_t h4_header_len;
static struct net_buf *h4_buf;
static size_t h4_payload_remaining;

// Forward declarations
static void mp_zephyr_hci_poll_now(void);
void mp_bluetooth_zephyr_port_poll_in_ms(uint32_t ms);

// RX queue helpers (can be called from IRQ context)
static inline bool rx_queue_is_full(void) {
    return ((rx_queue_head + 1) % RX_QUEUE_SIZE) == rx_queue_tail;
}

static inline bool rx_queue_is_empty(void) {
    return rx_queue_head == rx_queue_tail;
}

static bool rx_queue_put(struct net_buf *buf) {
    MICROPY_PY_BLUETOOTH_ENTER
    if (rx_queue_is_full()) {
        MICROPY_PY_BLUETOOTH_EXIT
        return false;
    }
    rx_queue[rx_queue_head] = buf;
    rx_queue_head = (rx_queue_head + 1) % RX_QUEUE_SIZE;
    MICROPY_PY_BLUETOOTH_EXIT
    return true;
}

static struct net_buf *rx_queue_get(void) {
    MICROPY_PY_BLUETOOTH_ENTER
    if (rx_queue_is_empty()) {
        MICROPY_PY_BLUETOOTH_EXIT
        return NULL;
    }
    struct net_buf *buf = rx_queue[rx_queue_tail];
    rx_queue_tail = (rx_queue_tail + 1) % RX_QUEUE_SIZE;
    MICROPY_PY_BLUETOOTH_EXIT
    return buf;
}

// Check if Zephyr BT buffer pools have free buffers available.
// Returns true if at least one buffer can be allocated without blocking.
// This prevents silent packet drops when buffer pool is exhausted.
static bool mp_bluetooth_zephyr_buffers_available(void) {
    // Try to allocate a buffer with K_NO_WAIT to test availability
    // If successful, immediately free it and return true
    struct net_buf *buf = bt_buf_get_rx(BT_BUF_EVT, K_NO_WAIT);
    if (buf) {
        net_buf_unref(buf);
        return true;
    }
    return false;
}

// HCI event codes (used in debug trace)
#define HCI_EVT_DISCONNECT_COMPLETE 0x05
#define HCI_EVT_CMD_COMPLETE        0x0E

// Reset H:4 parser state
static void h4_parser_reset(void) {
    h4_state = H4_STATE_TYPE;
    h4_header_idx = 0;
    h4_payload_remaining = 0;
    if (h4_buf) {
        net_buf_unref(h4_buf);
        h4_buf = NULL;
    }
}

// Process one byte through H:4 parser
// Returns true if packet is complete
static bool h4_parser_process_byte(uint8_t byte) {
    switch (h4_state) {
        case H4_STATE_TYPE:
            h4_type = byte;
            h4_header_idx = 0;

            // Determine header length based on packet type
            switch (h4_type) {
                case H4_EVT:
                    h4_header_len = 2;  // opcode + length
                    break;
                case H4_ACL:
                    h4_header_len = 4;  // handle(2) + length(2)
                    break;
                default:
                    error_printf("Unknown H:4 packet type: 0x%02x\n", h4_type);
                    h4_parser_reset();
                    return false;
            }

            h4_state = H4_STATE_HEADER;
            return false;

        case H4_STATE_HEADER:
            h4_header_buf[h4_header_idx++] = byte;

            if (h4_header_idx >= h4_header_len) {
                // Header complete, determine payload length
                size_t payload_len;

