andrewleech/micropython/ports/stm32/mpzephyrport.c
                switch (h4_type) {
                    case H4_EVT:
                        payload_len = h4_header_buf[1];  // length byte

                        // Allocate net_buf for event
                        h4_buf = bt_buf_get_evt(h4_header_buf[0], false, K_NO_WAIT);
                        if (!h4_buf) {
                            // Buffer exhaustion - don't reset parser, keep state for retry.
                            // Caller should process work queue to free buffers and retry.
                            error_printf("Failed to allocate event buffer (Issue #12)\n");
                            return false;
                        }

                        // bt_buf_get_evt() -> bt_buf_get_rx() already added H4 type byte
                        // Just add header to buffer (event code + length)
                        net_buf_add_mem(h4_buf, h4_header_buf, h4_header_len);
                        break;

                    case H4_ACL:
                        payload_len = h4_header_buf[2] | (h4_header_buf[3] << 8);

                        // Allocate net_buf for ACL
                        h4_buf = bt_buf_get_rx(BT_BUF_ACL_IN, K_NO_WAIT);
                        if (!h4_buf) {
                            // Buffer exhaustion - don't reset parser, keep state for retry.
                            // Caller should process work queue to free buffers and retry.
                            error_printf("Failed to allocate ACL buffer (Issue #12)\n");
                            return false;
                        }

                        // bt_buf_get_rx(BT_BUF_ACL_IN, ...) already added H4 type byte
                        // Just add header to buffer
                        net_buf_add_mem(h4_buf, h4_header_buf, h4_header_len);
                        break;

                    default:
                        h4_parser_reset();
                        return false;
                }

                if (payload_len == 0) {
                    // No payload, packet is complete
                    h4_state = H4_STATE_TYPE;
                    return true;
                } else {
                    // Transition to payload state
                    h4_payload_remaining = payload_len;
                    h4_state = H4_STATE_PAYLOAD;
                }
            }
            return false;

        case H4_STATE_PAYLOAD:
            if (!h4_buf) {
                error_printf("No buffer in payload state\n");
                h4_parser_reset();
                return false;
            }

            net_buf_add_u8(h4_buf, byte);
            h4_payload_remaining--;

            if (h4_payload_remaining == 0) {
                // Payload complete, packet is ready
                h4_state = H4_STATE_TYPE;
                return true;
            }
            return false;
    }

    return false;
}

// Callback for mp_bluetooth_hci_uart_readpacket() - called for each byte
// IMPORTANT: This may be called from interrupt context (IPCC IRQ on STM32WB)
// DO NOT call recv_cb() directly - queue the buffer for processing in scheduler context
static void h4_uart_byte_callback(uint8_t byte) {
    if (h4_parser_process_byte(byte)) {
        if (h4_buf) {
            struct net_buf *buf = h4_buf;
            h4_buf = NULL;  // Ownership transferred

            #if ZEPHYR_BLE_DEBUG
            // Debug: Trace HCI packets (type is first byte in buffer)
            uint8_t pkt_type = buf->data[0];
            if (pkt_type == H4_ACL) {
                // ACL data packet - decode handle and L2CAP/ATT info
                uint16_t handle = (buf->data[1] | (buf->data[2] << 8)) & 0x0FFF;
                uint16_t acl_len = buf->data[3] | (buf->data[4] << 8);
                DEBUG_HCI_printf("RX ACL: handle=0x%03x len=%d, first_byte=0x%02x\n",
                    handle, acl_len, (buf->len > 9) ? buf->data[9] : 0);
            } else if (pkt_type == H4_EVT) {
                // HCI Event - decode event code
                uint8_t evt_code = buf->data[1];
                if (evt_code == HCI_EVT_DISCONNECT_COMPLETE) {
                    // Disconnect Complete: [type=04][evt=05][len=4][status][handle_lo][handle_hi][reason]
                    uint8_t status = buf->data[3];
                    uint16_t handle = (buf->data[4] | (buf->data[5] << 8)) & 0x0FFF;
                    uint8_t reason = buf->data[6];
                    DEBUG_HCI_printf("RX DISCONNECT: handle=0x%03x status=%d reason=0x%02x\n",
                        handle, status, reason);
                } else if (evt_code == HCI_EVT_CMD_COMPLETE) {
                    uint16_t opcode = buf->data[4] | (buf->data[5] << 8);
                    DEBUG_HCI_printf("RX CMD_COMPLETE: opcode=0x%04x\n", opcode);
                }
            }
            #endif

            // Queue the buffer for processing in scheduler context
            // This avoids calling bt_hci_recv() from interrupt context
            if (!rx_queue_put(buf)) {
                error_printf("RX queue full\n");
                net_buf_unref(buf);
            } else {
                // Schedule task to process queued packets
                // This is safe from IRQ context (same as NimBLE UART IRQ)
                mp_zephyr_hci_poll_now();
            }
        }
    }
}

// This is called by soft_timer and executes at PendSV/scheduler level
static void mp_zephyr_hci_soft_timer_callback(soft_timer_entry_t *self) {
    #if ZEPHYR_BLE_DEBUG
    static int timer_fire_count = 0;
    timer_fire_count++;

    if (timer_fire_count <= 5) {
        DEBUG_HCI_printf("[TIMER FIRE #%d]\n", timer_fire_count);
    }
    #endif

    // CRITICAL: Reschedule the timer IMMEDIATELY before scheduling the task
    // This ensures the timer is always active for the next cycle
    soft_timer_reinsert(&mp_zephyr_hci_soft_timer, 128);

    #if ZEPHYR_BLE_DEBUG
    if (timer_fire_count <= 5) {
        DEBUG_HCI_printf("[TIMER FIRE #%d] Rescheduled for 128ms\n", timer_fire_count);
    }
    #endif

