andrewleech/micropython/ports/stm32/mpzephyrport.c
    mp_zephyr_hci_poll_now();
}

// HCI packet reception handler - called when data arrives
static void run_zephyr_hci_task(mp_sched_node_t *node) {
    (void)node;

    // Guard: IPCC IRQ can fire after deinit, scheduling this function via
    // mp_bluetooth_hci_poll_now(). Check if H:4 recv callback is still registered
    // — it's set during hci_stm32_open() and cleared during hci_stm32_close().
    // This allows processing during init (callback set) but blocks post-deinit
    // (callback cleared by bt_disable → hci_stm32_close).
    if (mp_bluetooth_zephyr_h4_get_recv_cb() == NULL) {
        DEBUG_HCI_printf("port_run_task: GUARD BLOCKED (h4_recv_cb=NULL)\n");
        return;
    }

    // Process Zephyr BLE work queues and semaphores
    mp_bluetooth_zephyr_poll();

    if (recv_cb == NULL) {
        return;
    }

    // Process queued RX buffers one at a time with work between each.
    // This ensures rx_work from CONNECTION_COMPLETE runs before
    // DISCONNECT_COMPLETE is delivered, matching full Zephyr's interleaving.
    {
        struct net_buf *buf;
        while ((buf = rx_queue_get()) != NULL) {
            int ret = mp_bluetooth_zephyr_h4_get_recv_cb()(mp_bluetooth_zephyr_h4_get_dev(), buf);
            if (ret < 0) {
                error_printf("recv_cb failed: %d\n", ret);
                net_buf_unref(buf);
            }

            // Process work after each event for proper interleaving.
            if (mp_bluetooth_zephyr_hci_processing_depth == 0) {
                mp_bluetooth_zephyr_hci_processing_depth++;
                mp_bluetooth_zephyr_work_process();
                mp_bluetooth_zephyr_hci_processing_depth--;
            }
        }
    }

    // Check buffer availability before reading from IPCC.
    // If no buffers available, process work queue to free some.
    // This prevents silent packet drops when buffer pool is exhausted (Issue #12).
    if (!mp_bluetooth_zephyr_buffers_available()) {
        mp_bluetooth_zephyr_work_process();
        if (!mp_bluetooth_zephyr_buffers_available()) {
            // Still no buffers - skip reading, will retry on next poll
            mp_bluetooth_zephyr_port_poll_in_ms(10);
            return;
        }
    }

    // Read HCI packets using port's transport abstraction
    // This works for both UART and IPCC (STM32WB)
    // Note: On STM32WB, this is called from IPCC interrupt so packets
    // are queued rather than processed immediately
    while (mp_bluetooth_hci_uart_readpacket(h4_uart_byte_callback) > 0) {
        // Keep reading while packets are available
        // Re-check buffer availability after each packet to prevent exhaustion
        if (!mp_bluetooth_zephyr_buffers_available()) {
            mp_bluetooth_zephyr_work_process();
            if (!mp_bluetooth_zephyr_buffers_available()) {
                // No buffers - stop reading, will retry on next poll
                mp_bluetooth_zephyr_port_poll_in_ms(10);
                break;
            }
        }
    }
}

static void mp_zephyr_hci_poll_now(void) {
    mp_sched_schedule_node(&mp_zephyr_hci_sched_node, run_zephyr_hci_task);
}

// Called by k_sem_take() to process HCI packets while waiting
// This is critical for preventing deadlocks when waiting for HCI command responses
// See docs/BLE_TIMING_ARCHITECTURE.md for detailed timing analysis
void mp_bluetooth_zephyr_hci_uart_wfi(void) {
    if (recv_cb == NULL) {
        return;
    }

    // ARCHITECTURAL FIX for regression introduced in commit 6bdcbeb9ef:
    // Connection events were not being received because run_zephyr_hci_task()
    // was removed from this function. Restoring it fixes connection event reception.
    //
    // run_zephyr_hci_task() calls mp_bluetooth_zephyr_poll() which is CRITICAL
    // for proper HCI event processing. It must be called BEFORE processing buffers.
    run_zephyr_hci_task(NULL);

    // Process any remaining queued RX buffers one at a time with work between each.
    {
        struct net_buf *buf;
        while ((buf = rx_queue_get()) != NULL) {
            mp_bluetooth_zephyr_h4_get_recv_cb()(mp_bluetooth_zephyr_h4_get_dev(), buf);

            if (mp_bluetooth_zephyr_hci_processing_depth == 0) {
                mp_bluetooth_zephyr_hci_processing_depth++;
                mp_bluetooth_zephyr_work_process();
                mp_bluetooth_zephyr_hci_processing_depth--;
            }
        }
    }

    #if defined(STM32WB)
    // Give IPCC hardware minimal time to complete any ongoing transfers
    // 100us is sufficient for hardware without introducing significant latency
    mp_hal_delay_us(100);
    #endif
}

// Stack monitoring helper
static inline uint32_t get_msp(void) {
    uint32_t result;
    __asm volatile ("MRS %0, msp" : "=r" (result));
    return result;
}

// Zephyr HCI driver implementation

static int hci_stm32_open(const struct device *dev, bt_hci_recv_t recv) {
    DEBUG_HCI_printf("hci_stm32_open\n");

    hci_dev = dev;
    recv_cb = recv;

    // Reset H:4 parser
    h4_parser_reset();

    // Initialize HCI transport (UART or IPCC)
    int ret = bt_hci_transport_setup(dev);
    if (ret < 0) {
        error_printf("bt_hci_transport_setup failed: %d\n", ret);
        return ret;
    }

    // Start the soft timer to begin periodic work queue processing
    // This starts the timer which will fire and process work queues + HCI packets
    mp_bluetooth_zephyr_port_poll_in_ms(128);  // Start timer with 128ms delay

    return 0;
}

static int hci_stm32_close(const struct device *dev) {
    DEBUG_HCI_printf("hci_stm32_close\n");

    recv_cb = NULL;
    h4_parser_reset();
    soft_timer_remove(&mp_zephyr_hci_soft_timer);

    // Teardown HCI transport
    return bt_hci_transport_teardown(dev);
}

static int hci_stm32_send(const struct device *dev, struct net_buf *buf) {
    (void)dev;

    // Map Zephyr buffer type to H:4 packet type
    uint8_t h4_type;
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wdeprecated-declarations"
    switch (bt_buf_get_type(buf)) {
        case BT_BUF_CMD:
            h4_type = H4_CMD;
            break;
        case BT_BUF_ACL_OUT:
            h4_type = H4_ACL;
            break;
        default:
            error_printf("Unknown buffer type: %u\n", bt_buf_get_type(buf));
            net_buf_unref(buf);
            return -1;
    }
    #pragma GCC diagnostic pop

    // Build H:4 packet: [type] + data
    size_t total_len = 1 + buf->len;
    uint8_t *h4_packet = m_new(uint8_t, total_len);

