andrewleech/micropython/ports/stm32/mpzephyrport.c
    h4_packet[0] = h4_type;
    memcpy(&h4_packet[1], buf->data, buf->len);

    // Trace HCI commands being sent (only when debug enabled)
    #if ZEPHYR_BLE_DEBUG
    if (h4_type == 0x01 && buf->len >= 3) {  // HCI Command
        uint16_t opcode = buf->data[0] | (buf->data[1] << 8);
        uint8_t param_len = buf->data[2];
        DEBUG_HCI_printf("[SEND] HCI Command: opcode=0x%04x param_len=%u\n", opcode, param_len);
    } else if (h4_type == 0x02 && buf->len >= 9) {  // ACL data
        // ACL header: handle(2) + length(2) = 4 bytes
        // L2CAP header: length(2) + CID(2) = 4 bytes
        // ATT data starts at offset 8
        uint16_t handle = (buf->data[0] | (buf->data[1] << 8)) & 0x0FFF;
        uint16_t acl_len = buf->data[2] | (buf->data[3] << 8);
        uint16_t l2cap_len = buf->data[4] | (buf->data[5] << 8);
        uint16_t l2cap_cid = buf->data[6] | (buf->data[7] << 8);
        uint8_t att_opcode = buf->data[8];
        DEBUG_HCI_printf("[SEND] ACL: handle=0x%03x acl_len=%d l2cap_len=%d cid=0x%04x att_op=0x%02x\n",
            handle, acl_len, l2cap_len, l2cap_cid, att_opcode);
        // Hex dump first 16 bytes
        int count = (buf->len > 16 ? 16 : buf->len);
        mp_printf(&mp_plat_print, "[SEND] HEX:");
        for (int i = 0; i < count; i++) {
            mp_printf(&mp_plat_print, " %02x", buf->data[i]);
        }
        mp_printf(&mp_plat_print, " [done %d][A] t=%lu\n", count, (unsigned long)mp_hal_ticks_ms());
    } else {
        DEBUG_HCI_printf("[SEND] type=0x%02x len=%u\n", h4_type, (unsigned int)total_len);
    }

    DEBUG_HCI_printf("HCI_SEND: uart_write len=%u h4=%02x t=%lu\n", (unsigned)total_len, h4_packet[0], (unsigned long)mp_hal_ticks_ms());
    #endif

    // Send via port's transport abstraction (UART or IPCC)
    int ret = mp_bluetooth_hci_uart_write(h4_packet, total_len);

    m_del(uint8_t, h4_packet, total_len);
    net_buf_unref(buf);

    return ret;
}

// HCI driver API structure
static const struct bt_hci_driver_api hci_stm32_api = {
    .open = hci_stm32_open,
    .close = hci_stm32_close,
    .send = hci_stm32_send,
};

// Device state (must be persistent and zero-initialized)
static struct device_state hci_device_state = {
    .init_res = 0,       // Success
    .initialized = true, // Mark as initialized
};

// HCI device structure (referenced by Zephyr via DEVICE_DT_GET macro)
// Define with the name that DEVICE_DT_GET expects: __device_dts_ord_0
// This is what DEVICE_DT_GET(0) expands to when DT_CHOSEN returns 0
// Use externally_visible to prevent linker garbage collection
__attribute__((used, externally_visible))
const struct device __device_dts_ord_0 = {
    .name = "HCI_STM32",
    .config = NULL,              // No config needed
    .api = &hci_stm32_api,
    .state = &hci_device_state,  // Required for device_is_ready()
    .data = NULL,
    .ops = {.init = NULL},       // No init function needed
    .flags = 0,                  // No special flags
};

// Provide accessible name for port code
__attribute__((used, externally_visible))
const struct device *const mp_bluetooth_zephyr_hci_dev = &__device_dts_ord_0;


// HCI transport setup (called by BLE host during initialization)
// Use __attribute__((used)) to prevent linker garbage collection
__attribute__((used))
int bt_hci_transport_setup(const struct device *dev) {
    (void)dev;

    #if defined(STM32WB)
    // STM32WB: IPCC transport, no external controller
    // rfcore_ble_init() is called by mp_bluetooth_hci_uart_init()
    //
    // Re-enable IPCC NVIC IRQ — disabled by bt_hci_transport_teardown() on previous
    // deinit cycle. rfcore_init() / ipcc_init() only runs once at boot from main.c,
    // not on subsequent bt_enable() cycles, so we must re-enable here explicitly.
    NVIC_EnableIRQ(IPCC_C1_RX_IRQn);
    return mp_bluetooth_hci_uart_init(MICROPY_HW_BLE_UART_ID, MICROPY_HW_BLE_UART_BAUDRATE);

    #else
    // Other STM32: UART transport with external controller (e.g. CYW43 on PYBD)
    // UART must be initialized before controller init — the CYW43 firmware
    // download uses mp_bluetooth_hci_uart_write/readchar via HAL macros.
    int ret = mp_bluetooth_hci_uart_init(MICROPY_HW_BLE_UART_ID, MICROPY_HW_BLE_UART_BAUDRATE);
    if (ret != 0) {
        error_printf("UART init failed: %d\n", ret);
        return ret;
    }

    // Initialize external BLE controller (power on, download firmware)
    ret = mp_bluetooth_hci_controller_init();
    if (ret != 0) {
        error_printf("Controller init failed: %d\n", ret);
        return ret;
    }

    return 0;
    #endif
}

// HCI transport teardown
__attribute__((used))
int bt_hci_transport_teardown(const struct device *dev) {
    (void)dev;
    DEBUG_HCI_printf("bt_hci_transport_teardown\n");

    #if defined(STM32WB)
    // Disable IPCC to prevent post-teardown callbacks from RF coprocessor.
    // CPU2 can send unsolicited events after HCI_Reset which would trigger
    // IPCC_C1_RX_IRQHandler → mp_bluetooth_hci_poll_now() into freed state.
    // Re-enabled in bt_hci_transport_setup() on next bt_enable().
    NVIC_DisableIRQ(IPCC_C1_RX_IRQn);
    NVIC_ClearPendingIRQ(IPCC_C1_RX_IRQn);
    // Barrier + delay to ensure in-flight IPCC handler completes
    __DSB();
    __ISB();
    // Clean all IPCC channel state so no stale messages carry over.
    rfcore_ipcc_reset();
    #else
    mp_bluetooth_hci_controller_deinit();
    #endif

    return mp_bluetooth_hci_uart_deinit();
}

// Main polling function (called by mpbthciport.c via mp_bluetooth_hci_poll)
void mp_bluetooth_hci_poll(void) {
    if (!mp_bluetooth_is_active()) {
        DEBUG_HCI_printf("mp_bluetooth_hci_poll: NOT ACTIVE, skipping\n");
        return;
    }

    // Call mp_bluetooth_zephyr_port_run_task directly to process HCI events
    // This includes: mp_bluetooth_zephyr_poll(), RX queue processing,
    // work queue processing, and reading HCI packets from transport
    run_zephyr_hci_task(NULL);

    // Schedule next poll if stack is active
    mp_bluetooth_zephyr_port_poll_in_ms(128);
}

// Initialize Zephyr port (called early in initialization)
void mp_bluetooth_zephyr_port_init(void) {
    DEBUG_HCI_printf("[INIT] mp_bluetooth_zephyr_port_init CALLED\n");

    // Force linker to keep __device_dts_ord_0 by referencing it
    // This prevents garbage collection with --gc-sections
    // Use volatile to prevent compiler from optimizing away the reference
    extern const struct device __device_dts_ord_0;
    volatile const void *keep_device = &__device_dts_ord_0;
    (void)keep_device;

    DEBUG_HCI_printf("[INIT] Calling soft_timer_static_init...\n");
    soft_timer_static_init(
        &mp_zephyr_hci_soft_timer,
        SOFT_TIMER_MODE_ONE_SHOT,
        0,
        mp_zephyr_hci_soft_timer_callback
        );
    DEBUG_HCI_printf("[INIT] soft_timer_static_init completed\n");

