andrewleech/micropython/ports/stm32/mpzephyrport.c
    // Note: STM32WB IPCC IRQ is re-enabled by bt_hci_transport_setup() during
    // bt_enable(). No need to enable it here — full shutdown always goes through
    // the transport setup/teardown cycle.
}

// Schedule HCI poll in N milliseconds
void mp_bluetooth_zephyr_port_poll_in_ms(uint32_t ms) {
    #if ZEPHYR_BLE_DEBUG
    static int resched_count = 0;
    resched_count++;

    if (resched_count <= 5) {
        DEBUG_HCI_printf("[RESCHEDULE #%d for %ums]\n", resched_count, (unsigned)ms);
    }
    #endif

    soft_timer_reinsert(&mp_zephyr_hci_soft_timer, ms);
}

// Debug wrapper for hci_core.c to print device info
// This avoids including MicroPython headers in Zephyr source files
void mp_bluetooth_zephyr_debug_device(const struct device *dev) {
    #if ZEPHYR_BLE_DEBUG
    DEBUG_HCI_printf("[DEBUG hci_core.c] bt_dev.hci = %p\n", dev);
    if (dev) {
        DEBUG_HCI_printf("[DEBUG hci_core.c]   name = %s\n", dev->name);
        DEBUG_HCI_printf("[DEBUG hci_core.c]   state = %p\n", dev->state);
        if (dev->state) {
            DEBUG_HCI_printf("[DEBUG hci_core.c]     initialized = %d\n", dev->state->initialized);
            DEBUG_HCI_printf("[DEBUG hci_core.c]     init_res = %d\n", dev->state->init_res);
        }
    }
    #else
    (void)dev;
    #endif
}

// HCI RX task stubs for non-FreeRTOS builds
// STM32 uses polling-based HCI reception, not a dedicated task
void mp_bluetooth_zephyr_hci_rx_task_start(void) {
    // No-op: STM32 uses IPCC interrupts and soft timer polling
}

void mp_bluetooth_zephyr_hci_rx_task_stop(void) {
    // No-op
}

bool mp_bluetooth_zephyr_hci_rx_task_active(void) {
    return false;  // Always use polling mode on STM32
}

// Non-inline version of mp_bluetooth_hci_poll_now for extmod code.
// modbluetooth_zephyr.c uses extern declaration, so we need a linkable symbol.
void mp_bluetooth_hci_poll_now(void) {
    mp_bluetooth_hci_poll_now_default();
}

// Port deinit - called during mp_bluetooth_deinit()
void mp_bluetooth_zephyr_port_deinit(void) {
    #if defined(STM32WB)
    // Safety: ensure IPCC IRQ is disabled. bt_disable() → hci_stm32_close() →
    // bt_hci_transport_teardown() should have already done this, but guard
    // against partial teardown (e.g. bt_disable() failure).
    NVIC_DisableIRQ(IPCC_C1_RX_IRQn);
    NVIC_ClearPendingIRQ(IPCC_C1_RX_IRQn);
    __DSB();
    __ISB();
    #endif

    // Drain any queued RX buffers to prevent net_buf leaks
    struct net_buf *buf;
    while ((buf = rx_queue_get()) != NULL) {
        net_buf_unref(buf);
    }
    rx_queue_head = 0;
    rx_queue_tail = 0;

    // Clear any partial H:4 parse state
    mp_bluetooth_zephyr_h4_reset();

    // Clean up shared soft timer and sched_node
    mp_bluetooth_zephyr_poll_cleanup();

    // Reset GATT memory pool for next init cycle (if using bump allocator)
    #if MICROPY_BLUETOOTH_ZEPHYR_GATT_POOL
    mp_bluetooth_zephyr_gatt_pool_reset();
    #endif
}

// ============================================================================
// Simple bump allocator for GATT structures (malloc/free shims)
// ============================================================================
// Zephyr BLE GATT requires memory that persists outside the GC heap.
// This provides minimal malloc/free using a static pool. Memory is only
// truly freed on BLE deinit (gatt_pool_reset).

#define GATT_POOL_SIZE 4096  // 4KB for GATT services/attributes

static uint8_t gatt_pool[GATT_POOL_SIZE];
static size_t gatt_pool_offset = 0;

// Simple allocation tracking for free() support
#define MAX_GATT_ALLOCS 64
static struct {
    void *ptr;
    size_t size;
} gatt_alloc_table[MAX_GATT_ALLOCS];
static int gatt_alloc_count = 0;

void *malloc(size_t size) {
    // Align to 4 bytes
    size = (size + 3) & ~3;

    if (gatt_pool_offset + size > GATT_POOL_SIZE) {
        error_printf("GATT pool exhausted (need %u, have %u)\n",
            (unsigned)size, (unsigned)(GATT_POOL_SIZE - gatt_pool_offset));
        return NULL;
    }

    void *ptr = &gatt_pool[gatt_pool_offset];
    gatt_pool_offset += size;

    // Track allocation for potential free()
    if (gatt_alloc_count < MAX_GATT_ALLOCS) {
        gatt_alloc_table[gatt_alloc_count].ptr = ptr;
        gatt_alloc_table[gatt_alloc_count].size = size;
        gatt_alloc_count++;
    }

    return ptr;
}

void free(void *ptr) {
    // In this bump allocator, individual frees don't reclaim memory.
    // Memory is only reclaimed on pool reset (BLE deinit).
    // We just mark the entry as freed for debugging.
    if (ptr == NULL) {
        return;
    }

    for (int i = 0; i < gatt_alloc_count; i++) {
        if (gatt_alloc_table[i].ptr == ptr) {
            gatt_alloc_table[i].ptr = NULL;  // Mark as freed
            return;
        }
    }
}

// Called during BLE deinit to reset the pool for next init cycle
void mp_bluetooth_zephyr_gatt_pool_reset(void) {
    gatt_pool_offset = 0;
    gatt_alloc_count = 0;
}

#endif // MICROPY_PY_BLUETOOTH && MICROPY_BLUETOOTH_ZEPHYR
